label lmr_maingame:

    stop music fadeout 5
    $ sunset_time()
    show fullmain_screen_lmr
    show black with fade2

    pause 5
    scene lmr_intro with fade2
    pause 32

    play music sakura_blossom fadein 3
    scene lmr_sakura with fade3
    pause 5

    window show

    lmr_thk "И снова эти падающие лепестки {i}сакуры{/i}…"
    $ persistent.cg1 = True
    lmr_thk "Словно капли дождя, они огибают дерево - свой дом, свои корни. Кружатся в бесконечном танце, заграждая вид вдаль."
    lmr_thk "Я никогда не таил много смысла в таких простых вещах. На вид всё кажется сплошной пурпурной метелью, что тут может быть необычного?"
    lmr_thk "Каждый лепесток то и делает, что падает. Падения никогда не были людям на руку."
    lmr_thk "Или это просто мне неизвестны удачные сценарии таких событий."
    lmr_thk "Над головой своим чередом шло противостояние ветра и медных облаков. Просто гадая, никогда не узнаешь, кто же победил."
    lmr_thk "Уже не будет былых предположений или догадок, расспросов о влиянии одного на другое. Такие моменты сами по себе исчезли из памяти."
    lmr_thk "Все мои эмоции длительно уносились наверх, оставляя за собой лишь полу-прозрачный след."
    lmr_thk "А если это вовсе не след, а ниточка? Вот дёрни за неё и сразу же притянешь всё обратно."
    lmr_thk "Конечно, связи между это точно не сделает, но ведь попытки, разве они так ужасны?"
    lmr_thk "Мимолётные мгновения новых идей. Разворот вокруг и падение. Разочарование в себе."
    lmr_thk "Эти листки... Может быть, они тоже что-нибудь да ищут?"
    lmr_thk "Тёмный пурпур не имеет свойства искать, думать, быть красивым. Всё, ради чего он живёт - смерть."
    lmr_thk "Со временем он становится менее привлекательным, более обыденным, скучным и глупым."
    lmr_thk "Неужели в этом заключается весь его смысл?"

    window hide

    pause 3

    window show

    lmr_thk "Раньше я очень любил фантазировать. Особенно с кем-то в компании!"
    lmr_thk "Фантазии на пару с разговорами были лучшей потехой и успокоительным."
    lmr_thk "Только зажмурь глаза, прижми руки ко лбу и начинай воплощать мысли вслух."
    lmr_thk "Признаться самому себе, это любил не только я."

    window hide

    pause 1.5

    window show

    lmr_thk "Люди сходятся, чтоб быть вместе.{w} У них есть мечты, цели и стремления."
    lmr_thk "Отношения или брак - это не только способ закрепиться между собой, не просто показатель для общества. Это яркое пламя, что способно сжечь всё, что мешает ему разрастаться."
    lmr_thk "Многие вещи гасят его целиком, не позволяя создателям огня даже на секунду взглянуть в небо, чтоб узреть, как последние искры любви скроются в густой, полу-прозрачной полосе."
    cat_girl "Чудотворные слова..."
    lmr_thk "От смущения я легонько улыбнулся и опустил голову."
    cat_girl "Зачем мы опять пришли сюда?"
    nik_kun_boy "Чтоб помечтать, ещё хотя бы разок, на прощание. Я знаю, ты так сильно любишь это."
    lmr_thk "Слева от меня послышался шорох."
    cat_girl "Представь, если в жилах этих листков спрятанна бесконечная дорога. Она не имеет ни края, ни конца. По бокам находятся бескрайние поля и леса."
    nik_kun_boy "Звучит интересно. И что же там в конце?"
    cat_girl "Я ведь сказала, что она бесконечная!{w} Как у неё будет что-то в конце?"
    lmr_thk "Девушка мило рассмеялась и обняв меня за плечо, устремила взгляд вдаль."
    lmr_thk "Сегодня я здесь, чтоб мечтать.{w} Мечтать последний раз, перед самим уходом."
    lmr_thk "Больше не будет сил, билета обратно, не будет слов:"
    cat_girl "Давай бросим этот день и вернёмся!{w} Я хочу ещё немного полюбоваться нашими мыслями."
    lmr_thk "Я не собирался долго готовиться к этому моменту. Мне надоели глупые фантазии и иллюзии, какими бы они не вышли милыми или игривыми.{w} Я давно перерос всё это, изменился.{w} Мы изменились."
    nik_kun_boy "Нет, придётся оставить этот период позади, принять решение - сейчас или никогда."
    lmr_thk "Девушка сохраняла своё положение, но её лицо изменилось.{w} Грусть, обида, непонимание?"
    lmr_thk "Никогда точно не скажешь переживания человека, просто взглянув ему в лицо."
    cat_girl "Скажи честно, мы больше не вернёмся?"
    nik_kun_boy "Не знаю..."
    lmr_thk "Я не любил врать, делать вид, что всё хорошо, подстраиваться под других людей.{w} Она не любила точно также."
    nik_kun_boy "Постараюсь узнать, когда-нибудь."
    lmr_thk "Обратив на меня взгляд из под шёлковой чёлки, я заметил уголок улыбки."
    lmr_thk "Я правда не знаю, что будет завтра. Нет ни единой идеи, лишь догадки и теории."
    lmr_thk "Она не знает, будет ли любить мечтать завтра. Нету никаких гарантий, лишь уверения и утверждения."
    lmr_thk "Понятно лишь то, что завтра всё будет по другому, для обоих нас."
    lmr_thk "Подскажут ли конкретику лепестки?{w} Узнаем."
    lmr_thk "Я всегда любил вихрь, но не знал о вихре перемен.{w} Совсем скоро я точно об этом узнаю."
    lmr_thk "Пора решать, раз и навсегда. Больше нельзя упираться и идти назад.{w} Выбор передо мной.{w} Перед нами."
    lmr_thk "И почему-то, мне кажется, что мы давным-давно его сделали, точно также, как когда-то разожгли наше пламя."

    window hide

    stop music fadeout 5
    scene black with fade3

    pause 5

    $ day_time()
    play ambience room_mc_morning fadein 3
    scene lmr_roomday with fade3

    window show

    lmr_thk "Вспышка света ударила мне в лицо."
    lmr_thk "Протерев глаза кулаками, я скинул с себя одеяло и выглянул в сад своими сонными зрачками."
    lmr_thk "Шум кондиционера, радостное пение птиц и стройка на соседней улице. Первый раз за всё мое время провёденное тут, эти звуки не вызывали неприязнь или отвращение."
    lmr_thk "Я сел на кровать и почесал голову."
    lmr_thk "Именно сейчас я начал ценить их так, как не ценил никогда."
    lmr_thk "Постоянное надоедание одной и той же пластинки выводило из себя. Не скажешь подобного и именно сейчас."
    lmr_thk "Я встал на ноги и подошёл к своему столу."
    nik_kun "Ух, как голова болит... Я спал крайне крепко."
    nik_kun "Отличные сны снились..."
    lmr_thk "Вскинув лёгкую улыбку, отправившись принимать душ и водные процедуры, последний раз в этом доме.{w} Сегодня нужно быть чище, чем когда-либо!"

    stop ambience fadeout 2

    window hide

    scene lmr_kitchenday with wiperight
    play music sharp_edges fadein 2

    window show

    lmr_thk "Многовато места для одного, хех, даже в этой ситуации дом не обиднеет, но и не пополнится. Хотя это ещё не точно..."
    lmr_thk "Я открыл холодильник, в надежде найти еды ровно на один приём пищи."
    lmr_thk "Обнаружив два яйца и немного овощей, руки принялись готовить одно из самых простых, но неимоверно вкусных блюд - овощной омлет."
    lmr_thk "В процессе подготовки продуктов для завтрака, в голове заёрзали интересные мысли."
    lmr_thk "Этот дом не пополнится. Правда ли это? Химицу может вполне найти себе парня."
    lmr_thk "Странные слова. На протяжении многих лет она мазалась под меня, как только могла."
    lmr_thk "Благо, человек не глупый, смогла осознать и принять мою ситуацию."
    lmr_thk "Пытаясь не криво разбить яйца, Химицу не хотела покидать голову."
    lmr_thk "У каждого свои пути, пускай, для других всё звучит не так, как они хотят слышать."
    lmr_thk "Я жил в этом доме всё время, после переезда. Прошло столько времени, и я покидаю его вот так..."
    lmr_thk "Оставив прожариваться омлет, я встал рядом с плитой."
    lmr_thk "Хорошо, что получилось отдать его в добрые руки."
    lmr_thk "Если быть более верным, то продать."

    window hide

    pause 2.5

    window show

    lmr_thk "Обыскав другие полки и шкафы удалось обнаружить ещё и ломтик хлеба. Теперь завтрак точно удался!"
    lmr_thk "Выложив еду на тарелку и сев за стол, я принялся завтракать."
    lmr_thk "Когда отец Химицу, Ито, узнал о моих планах продать своё жильё, он сразу же пригласил меня на небольшой \"разговор\"."
    lmr_thk "Дело зашло о сделке, привкательной для обеих сторон."
    lmr_thk "Мне предложили двадцать пять тысяч доларов за жилье. В условие входило ещё и то, что я должен оставить все свои вещи на местах, не наводя порядок."
    lmr_thk "На тот момент это звучало действительно странно. Но позже речь зашла о Химицу."

    window hide

    pause 2

    window show

    lmr_thk "Омлет равномерно прожарился с двух сторон, позволяя полноценно насладиться едой."
    lmr_thk "Ито поведал, что хочет отдать мой дом его дочери."
    lmr_thk "Связанно ли это с её любовью ко мне? А может это была вовсе и не любовь."
    lmr_thk "Я неспешно ковырялся в тарелке, тупо глядя в пол."
    lmr_thk "Странное чувство, когда осознаешь, что врятли ещё когда-либо посетишь родное место."
    lmr_thk "По телу должны были пробежать мурашки, но этого не произошло."
    lmr_thk "Мы сможем видеться, я уверен. Я буду наведываться сюда, время от времени. Мы ведь не в каменном веке живём, чтоб связи не было."
    lmr_thk "Я убрал тарелку в раковину."
    lmr_thk "Сказал даже не мыть посуду..."
    lmr_thk "Осмотрев свою родную кухню ещё один раз, руки опустились в карманы штанов."
    lmr_thk "Пора, настало время. Я обязательно буду навещать тебя."
    lmr_thk "Похлопав по стене, ноги подались в коридор."

    window hide

    pause 3

    scene lmr_corridor_day with wipeleft

    window show 

    lmr_thk "В прихожей меня уже ожидал собранный вчера рюкзак. Он содержал в себе лишь всё самое важное и необходимое."
    lmr_thk "Обувшись и натянув рюкзак на плечи, взгляд последний раз упал на одинокое помещение."
    lmr_thk "Она точно навёдет в тебе порядок, всё будет лучше прежнего."

    window hide 

    stop ambience fadeout 3
    stop music fadeout 2.5

    scene black with Dissolve(3.0)

    pause 3

    scene lmr_house with dissolve2

    pause 2.5

    play music nobody_can_save_me fadein 3

    scene lmr_house_of_himitsu with wiperight

    window show

    lmr_thk "Подходя к дому подруги, моё настроение начало подниматься. Как же приятно ощущать родные места."
    lmr_thk "Подбежав к входной двери, я пару раз постучался, в надежде, что моё появление заметят и без использования дверного звонка."

    show ito_full with dissolve

    lmr_thk "Ждать долго не пришлось, двери отворил хозяин дома - Ито."
    lmr_thk "Выглянув из-за двери, он ступил на улицу."
    lmr_thk "Осмотрев меня с ног до головы, Ито обпёрся об стенку дома."
    nik_kun "Я вам пришёл отдать ключи, как и договаривались."
    lmr_thk "Порывшись в кармане я протянул ему предмет."
    lmr_thk "Ито приподнял одну сторону своего пиджака и достал оттуда конверт."
    lmr_thk "Совершив обмен, я сразу же спрятал деньги в рюкзак."
    lmr_thk "Отец Химицу прокрутил ключи на пальце и ловким движением закинул их в карман."
    ito_lmr "Засунь конверт поглубже.{w} Смотри, чтоб не ограбили. Как ни как сумма приличная."
    lmr_thk "Я лишь кивнул и взглянул в окно дома."
    nik_kun "А Химицу случайно нету?"
    ito_lmr "Нету.{w} Ушла гулять, как я знаю.{w} А что такое?"
    nik_kun "Просто хотелось попрощаться."
    ito_lmr "Разве мы растаёмся?{w} Я надеялся, что ты будешь навещать родное жилище и свою подругу."
    nik_kun "Конечно буду, думал об этом ни раз.{w} Для вашей семьи всегда найдётся время."
    lmr_thk "Ито молча порылся в другом кармане и протянул мне небольшую бумажку."
    ito_lmr "Мой номер.{w} Будут проблемы - обязательно звони."
    nik_kun "Спасибо вам, огромное спасибо!"
    ito_lmr "Береги себя, Николай, и тех, кто рядом с тобой."
    lmr_thk "Ито протянул мне руку."
    nik_kun "Я не забываю тех, кто был и остаётся со мной."

    window hide

    hide ito_full
    scene lmr_street_local
    with wipeleft

    window show

    lmr_thk "Выйдя на знакомую улицу, ноги понесли меня дальше от родных мест."
    lmr_thk "Двигаясь прогулочным шагом, я успевал разглядывать множество атрибутов улочки, по которой каждый день возвращался домой из школы."
    lmr_thk "Было бы неплохо и туда заскочить."
    lmr_thk "Стройка напротив длится уже второй год. Забавно, что мне не удалось дождаться её завершения."
    lmr_thk "Хотя это мелочи, по сравнению с тем, что ждут другие люди."
    lmr_thk "Внезапно, мне захотелось пересмотреть конверт с деньгами, который дал мне Ито. Вдруг меня обвели вокруг пальца?"
    lmr_thk "Зайдя за угол и осмотревшись вокруг, я достал конверт и акураттно его развернул."
    lmr_thk "Достав всю сумму, мои руки были осыпанны тысячами."
    nik_kun "Тысяча, две, три..."
    lmr_thk "Купюр было действительно много. Посчитать всё с первого раза было довольно сложно."
    lmr_thk "После очередной попытки я закончил подсчёт."
    nik_kun "Двадцать семь тысяч...{w} А обещал двадцать пять."
    lmr_thk "Улыбнувшись и спрятав деньги, я продолжил движение."
    nik_kun "Ито не мог ошибиться.{w} Спасибо..."

    window hide

    stop music fadeout 3
    scene lmr_city with wiperight
    play ambience tokyo_street_day fadein 2

    window show

    lmr_thk "Утренний Токио выходного дня жил своей непроглядной жизнью.{w} Суббота здесь точно не была выходным."
    lmr_thk "Люди двигались довольно оживлённо, пытаясь не останавливаться ни на миг."
    lmr_thk "На удивление, таким людям, как я, эта суета не приносила дискомфорта.{w} Скорее наоборот."
    lmr_thk "Вглядываясь в настолько работоспособных людей, внутри тебя начинает расти мотивация стать таким же.{w} Правда, всего лишь на словах."
    lmr_thk "Перебежав дорогу на красный свет, меня понесло в первое место, которое хотелось бы посетить."

    window hide

    stop ambience fadeout 3

    scene lmr_school_close with wipeleft

    play music batlle_symphony fadein 3

    window show

    lmr_thk "Моя школа, академия?{w} Никогда точно не задумывался об этом.{w} Лишь был наделён ведомством, что здесь собранны люди десятков народов и национальностей."
    lmr_thk "Дворик не имел особых отличий от внешнего корпуса."
    lmr_thk "Это место никогда не казалось мне таким привлекательным, как тот же центр города. Дело даже не в плохих воспоминаниях и связи с трудовым лагерем."
    lmr_thk "Кому я пытаюсь доказать. Все люди не любят школу."
    lmr_thk "Пнув мелкий камешек в сторону кустов, я устремился внутрь."
    nik_kun "Жди меня, Кёске."

    window hide

    scene lmr_school_corridor with wiperight

    window show

    with hpunch
    lmr_thk "Быстро влетев в школьный коридор, меня чуть не сбил один из школьников."
    nik_kun "Какого хрена ты делаешь тут в суботту?!"
    teenager "Не твоё дело!"
    lmr_thk "Мягко послав меня подальше, школяр запрыгнул за угол коридора."
    lmr_thk "И вот так меня решили встретить?{w} Крайне некультурно."
    with hpunch
    lmr_thk "Хотев быстро промелькнуть в свой бывший класс, в меня вновь врезались."
    nik_kun "Да вы издеваетесь..."

    show himi_what_full with dissolve

    lmr_thk "Подняв голову, передо мной стояла удивлённая Химицу."
    nik_kun "А, это ты..."

    hide himi_what_full
    show himi_smile_full
    with dspr

    lmr_thk "Девушка быстро помогла мне отруситься."
    himi_sun "Приветик, а чего в школу пришёл?"
    nik_kun "Да так, попрощаться с Кёске.{w} Он сегодня должен был быть тут на дополнительном занятии."

    hide himi_smile_full
    show himi_what_full
    with dspr

    himi_sun "Попрощаться?{w} Что, уже уезжаешь?"
    nik_kun "К сожалению пора."

    hide himi_what_full
    show himi_sad_full
    with dspr

    lmr_thk "Химицу опустила взгляд вниз."
    himi_sun "Кёске-кун уже ушёл..."
    nik_kun "Ничего страшного, я ведь и тебя искал."

    hide himi_sad_full
    show himi_what_full
    with dspr

    himi_sun "Зачем это, Нико-кун?"
    nik_kun "Ну как!{w} Хочу увидеть тебя.{w} В ближайшие месяца встретиться не выйдет."

    hide himi_what_full
    show himi_sohappy_full
    with dspr

    himi_sun "Ух-ты, мне очень приятно!"
    nik_kun "По другому не выйдет, ты ведь подруга моего детства!"

    hide himi_sohappy_full
    show himi_disagree_full
    with dspr

    lmr_thk "Химицу резко приобняла меня."
    himi_sun "Неужели вообще не выйдет видеться?"
    nik_kun "Прости, абсолютно никак.{w} Пока на новом месте обостроюсь, сама понимаешь."
    himi_sun "Конечно..."
    lmr_thk "Химицу положила свою голову мне на грудь, с грустным выражением лица она не собиралась меня отпускать."
    nik_kun "Солнышко, не волнуйся, я обязательно буду навещать тебя в будущем.{w} Всё хорошо."
    himi_sun "А твой дом?{w} Неужели ты его продал?"
    nik_kun "Ну-у..."
    lmr_thk "Химицу не знала о нашей сделке с Ито, думаю, срывать такой грандиозный сюрприз не стоит."

    hide himi_disagree_full
    show himi_smile_full
    with dspr

    himi_sun "Я поняла, хорошо, это твоё решение."
    lmr_thk "Она отпустила меня и отошла назад."
    himi_sun "У меня тут некоторые дела, нужно будет отойти."
    nik_kun "Конечно, не мешаю.{w} И раз Кёске нет, то и я тогда тоже пойду."
    lmr_thk "Я посмотрел к себе под ноги. Неужели именно так должно проходить прощание друзей, которые вместе более десяти лет?"
    lmr_thk "Свежий ветер гулял по коридорам, иногда влетая в голову."
    nik_kun "Запомни, я ещё приеду, и не раз.{w} Буду звонить!{w} У меня есть ваш номер телефона."

    hide himi_smile_full
    show himi_disagree_full
    with dspr

    himi_sun "Нико-кун..."
    nik_kun "Да?"
    lmr_thk "Химицу стояла, не решаясь сделать что-либо."

    hide himi_disagree_full
    show himi_sohappy_full
    with dspr

    himi_sun "Удачной дороги!"
    nik_kun "Спасибо тебе!"

    hide himi_sohappy_full with dissolve

    stop music fadeout 3

    lmr_thk "Улыбнувшись во весь рот она развернулась на месте и побежала в противоположную сторону."

    window hide

    scene lmr_school_close with wiperight

    window show

    lmr_thk "Странное вышло прощание.{w} Будто она не договорила чего-то..."
    lmr_thk "Всё же, что сказанно, то сказанно."
    lmr_thk "Я взглянул на часы, что весели на школе."
    lmr_thk "Не мало времени прошло с утра.{w} Думаю, пора выдвигаться на встречу."

    window hide

    scene lmr_centre_day with wiperight

    play music good_godbye fadein 3

    window show

    lmr_thk "Явившись в центр, меня снесло волной движения и звуков."
    lmr_thk "Это место всё время притягивало темпом своей жизни."
    lmr_thk "Витрины с множеством разной всячины, высотки и указательные знаки на японском со стрелками, что указывают путь к различным магазинам - это настоящий центр Токио."
    lmr_thk "Так уж повезло, что и Катя живёт прямо тут."
    lmr_thk "Мне, как обычному школьнику, не выйдет переехать в столь роскошное место. То ли дело она - дочка американской \"знати\"."
    lmr_thk "Подбежав к подъезду, руки поправили костюм."
    lmr_thk "Надеюсь выгляжу нормально. Пытался собраться как можно лучше...{w} Хоть бы рюкзак не портил образ."
    lmr_thk "Я набрал нужные цифры на домофоне и принялся ожидать ответа."
    lmr_thk "Практически сразу из динамика раздался знакомый голос."
    cat_lmr "Кто там?"
    nik_kun "Сама угадай."
    cat_lmr "Из этого города я знаю только одного человека.{w} Незнакомцам не открываю."
    nik_kun "Катя, хватит давить ситуацию!{w} Открывай!"
    lmr_thk "Я услышал небольшой, угасающий смешок. "

    play sound intercom_opened

    extend "Дверь отворилась."

    window hide

    scene lmr_cat_house_day with wipeleft

    window show 

    nik_kun "Ну и что это за игрища?"
    cat_lmr "Сам же начал."

    show cat_smile_full_1_1 with dissolve

    lmr_thk "Из соседеней комнаты показалась Кэтрин."
    nik_kun "Уже собрала вещи?"
    cat_lmr "Мне есть что собирать?{w} Вкинула косметику с деньгами лишь."
    lmr_thk "Я заглянул за спину девушки."
    nik_kun "А вот тот фиолетовый чемодан в соседеней комнате по приколу лежит?"

    hide cat_smile_full_1_1
    show cat_doesntmatter_full_1_1
    with dspr

    cat_lmr "Блин, думала, что ты не заметишь!"
    lmr_thk "Катя по доброму улыбнулась."
    lmr_thk "Она присела на подлокотник дивана и взглянула в мои глаза."

    hide cat_doesntmatter_full_1_1
    show cat_smile_full_1_1
    with dspr

    cat_lmr "С этим рюкзачком ты такой забавный."
    nik_kun "Так и знал, что он испортит меня!"
    lmr_thk "Я быстро скинул рюкзак на пол."

    hide cat_smile_full_1_1
    show cat_surprise_2_1
    with dspr

    cat_lmr "Да нет, чего ты.{w} Каждый человек может выглядеть по разному."
    nik_kun "Не скажешь, что я прекрасный всегда?"

    hide cat_surprise_2_1
    show cat_sohappy_full_1_2
    with dspr

    cat_lmr "Не люблю врать. Как мне ведомо, ты тоже."

    nik_kun "Знаешь меня насквозь, тут мне не победить."
    cat_lmr "Само собой. Как вижу, ты тоже готов."
    nik_kun "Да, и у меня есть кое-что, чему ты крайне сильно обрадуешься."
    cat_lmr "Ну-ну."
    lmr_thk "Я поставил рюкзак на стол и принялся искать конверт."
    lmr_thk "Достав сокровищницу, я кинул её на стол.{w} Содержимое вывалилось на стол."

    hide cat_sohappy_full_1_2
    show cat_surprise_2_1
    with dspr

    lmr_thk "Завидев полную кучу денег, девушка открыла рот."
    nik_kun "Двадцать семь тысяч баксов."
    cat_lmr "Ник...{w} Ты шутишь надо мной?"
    lmr_thk "Ухмельнувшись, я поставил ногу на стул."
    nik_kun "Ни капли."

    hide cat_surprise_2_1
    show cat_angry_full_2_1
    with dspr

    cat_lmr "Нет, ты всё же издеваешься!{w} У меня блин всего-лишь тысяч восемь есть, и то больше половины мать дала, а тут вот это!"
    cat_lmr "Признавайся, откуда вытащил?{w} Обокрал кого-то?"
    nik_kun "Всё намного проще. Как думаешь, мой дом будет одиноко ждать, пока его ограбят?"

    hide cat_angry_full_2_1
    show cat_surprise_2_1
    with dspr

    cat_lmr "Ты что продал свой дом?{w} За такие деньги?!"
    nik_kun "Нужно уметь находить правильных людей."

    window hide

    hide cat_surprise_2_1
    $ persistent.cg2 = True
    scene fullposter2
    with dissolve

    window show

    lmr_thk "Катя спрыгнула с перила и подбежав ко мне, обняла."
    cat_lmr "Слава Богу!{w} Ты бы знал, как я переживала за деньги, Ник..."
    nik_kun "Всё хорошо, теперь у нас есть куча средств, чтоб нормально устроиться на новом месте и жить в хороших условиях.{w} Всё для нас, я постарался."
    cat_lmr "Ты огромный молодец!"

    window hide

    scene lmr_cat_house_day
    show cat_sohappy_full_1_2
    with wipeleft

    window show

    cat_lmr "В честь такого события, я разрешаю тебе самому выбрать места, в которых мы будем сегодня гулять."
    nik_kun "Прям {b}разрешаешь{/b}?"

    hide cat_sohappy_full_1_2
    show cat_smile_full_1_1
    with dspr

    lmr_thk "Ответом последовала лёгкая смена эмоции."
    nik_kun "Понятно всё с тобой.{w} Собирайся и пойдём.{w} Рюкзак оставлю тут, больше девать мне его нету куда."
    cat_lmr "Я уже готова, пойдём."

    window hide

    hide cat_smile_full_1_1
    scene lmr_centre_day
    show cat_smile_full_1_1
    with wiperight
    play music nobody_can_save_me fadein 3

    window show

    lmr_thk "Выйдя на улицу, Кэтрин взяла меня за руку."
    cat_lmr "Куда желаешь пойти для начала?"
    nik_kun "Конечно же в бар!"

    hide cat_smile_full_1_1
    show cat_sad_2_2
    with dspr

    cat_lmr "Шутишь?"
    nik_kun "Нет, мы идём в бар!"
    cat_lmr "Ник, ну это слиш..."

    hide cat_sad_2_2
    show cat_surprise_2_1
    with dspr

    lmr_thk "Я осторожно приставил свой палец к её губам и потянул за руку."
    nik_kun "Имею право!"

    window hide

    hide cat_surprise_2_1
    scene lmr_bar_day
    show cat_angry_full_2_1
    with wiperight

    window show

    cat_lmr "Не могу поверить, что наше последнее свидание в Токио начнётся с этой бухаловки!"
    nik_kun "Не забывай, что главный тут я."
    nik_kun "Ладно, просто хочется обойти все мне памятные места."

    hide cat_angry_full_2_1
    show cat_doesntmatter_full_1_1
    with dspr

    cat_lmr "И оно для тебя памятное?"
    lmr_thk "Кэтрин кивнула головой на вывеску позади неё."
    nik_kun "А почему не должно им быть?"
    cat_lmr "Тогда давай не тянуть с этим.{w} Побыстрее со всеми попрощаешься и пойдём дальше."
    lmr_thk "Больше сдерживать смех я мог."
    nik_kun "Видела бы ты себя!"

    hide cat_doesntmatter_full_1_1
    show cat_surprise_2_1
    with dspr

    cat_lmr "Что?"
    nik_kun "Не собирался я идти пить.{w} А с персоналом ещё вчера вечером одну рюмку накатил за счёт заведения."
    nik_kun "Всё же нужно было увидеть это легендарное место под конец..."
    lmr_thk "Я спокойно похлопал по стенке дома и устремил взгляд под ноги."

    hide cat_surprise_2_1
    show cat_angry_full_2_1
    with dspr

    cat_lmr "Отлично, заканчиваем эту комедию!{w} Теперь будем идти туда, куда угодно мне!"

    with hpunch
    hide cat_angry_full_2_1 with dissolve

    lmr_thk "Катя резко взяла меня под руку и потащила как можно дальше от бара."

    window hide

    scene lmr_lunapark_day
    show cat_sohappy_full_1_2
    with wipeleft

    window show

    nik_kun "Лунапарк?{w} Ты серьёзно?"

    hide cat_sohappy_full_1_2
    show cat_angry_full_2_1
    with dspr

    cat_lmr "Лучше бухать, чем проводить время со своей девушкой в приличных местах?"

    hide cat_angry_full_2_1
    show cat_sad_2_2
    with dspr

    cat_lmr "И как я помню, первые наши встречи тут ты очень сильно любил."
    lmr_thk "Кому врать, она права."
    nik_kun "Хорошо, на какой атракцион пойдём?"

    hide cat_sad_2_2
    show cat_sohappy_full_1_2
    with dspr

    cat_lmr "Для начала предлагаю подумать на лавке, взвесить все аргументы и варианты..."
    lmr_thk "Катя явно давила моё терпение.{w} Она ждала."
    stop music fadeout 5
    nik_kun "Понял-понял, побежали очередь занимать."

    window hide

    hide cat_sohappy_full_1_2
    $ persistent.cg3 = True
    scene fullposter3
    with wiperight

    play music one_more_light fadein 3

    window show

    lmr_thk "Отстояв длинную очередь, мы таки смогли сесть в кабинку заведного колеса обозрения."
    lmr_thk "Кэтрин заняла место поближе к окну, я сел напротив неё."
    nik_kun "Раньше ты не так сильно любила смотреть на виды города."
    cat_lmr "Не до этого было раньше."
    nik_kun "Тогда в чём колеса обозрения?"
    cat_lmr "В твоём понимании, чтоб смотреть в окно.{w} Поверь, я в него насмотрелась, когда летела в Японию."
    cat_lmr "Для меня это просто способ уйти от земли и её проблем.{w} Ты проводишь в воздухе хотя бы частицу времени.{w} Она самая приятная и успокаивающая."
    nik_kun "Хочешь сказать, что время проведённое снизу раздражает тебя?"
    cat_lmr "Нет..."
    lmr_thk "Катя кратко ответила на мой вопрос и всё больше всмотрелась в окно."
    cat_lmr "Какой же Токио всё же большой.{w} Вон центр, вон твоя улочка.{w} А там..{w} смотри!"
    lmr_thk "Она притянула меня к себе и тыкала пальцем в стекло."
    cat_lmr "Мост!{w} Какой же он ночью красивый..."
    lmr_thk "Отпустив меня, я вновь уселся напротив."
    cat_lmr "Почему ты не любуешься видом со мной?"
    nik_kun "Я больше любуюсь тобой."
    cat_lmr "На это ещё будет время, причём много, поверь."
    nik_kun "Ты сама говорила, что времени в жизни не так уж и много."
    cat_lmr "Для этого достаточно..."
    lmr_thk "Она прислонила свою ладошку к стеклу."
    lmr_thk "Хоть я сидел с другой стороны, но постарался в точности повторить её действие."
    cat_lmr "Как думаешь..{w} правда есть смысл делать то, что мы собираемся?"
    nik_kun "Такое не решают быстро.{w} Точно также, как и мы. Много раз думали, всё взвешивали."
    cat_lmr "Я понимаю, но одно осталось на стороне.."
    cat_lmr "Ты ведь не хочешь уезжать?"
    nik_kun "Всё уже было сказано. Ничего другого не могу добавить."
    cat_lmr "Ник, так нельзя!{w} Нужно сделать поступок, который будет приятным для нас двоих!"
    nik_kun "Мне будет приятно, если ты станешь счастливой!{w} Я хочу, чтоб ты была счастливой!"
    lmr_thk "Кэтрин отпустила ладонь от окна."
    nik_kun "Я смогу приспособиться к новым условиям и местам.{w} Тем более, ты рядом.{w} Если меня можно назвать туристом, что первый раз видит эту страну, то ты её гражданка."
    nik_kun "Так точно будет лучше..."
    lmr_thk "Я повернул голову в другую сторону."
    lmr_thk "Внезапно, Катя взяла мою руку в свою."
    cat_lmr "Прости, Ник, я очень сильно волнуюсь...{w} С недавних пор переезды асоциируются только с чем-то негативным..."
    nik_kun "Это нормально, когда тебе не нормально.{w} Я буду рядом, мы всё решим вместе, ты больше не будешь думать обо всём одна."
    cat_lmr "Очень приятно слышать такое..."
    lmr_thk "Я выглянул в окно."
    nik_kun "Почти на земле."
    cat_lmr "Пока мы точно не приземлились..."
    lmr_thk "Катя потянула меня на себя."

    window hide

    stop music fadeout 4
    scene black with Dissolve(4.0)

    pause 5.5

    play ambience garden_sunset fadein 3
    $ sunset_time()
    scene lmr_garden_sunset with Dissolve(3.0)

    window show

    lmr_thk "Не смотря на столь короткий день, мы решили выбраться в парк."
    lmr_thk "Именно на закате он выглядел более золотым, осенним.{w} Завораживающий вид."

    play music heavy fadein 3

    show cat_doesntmatter_full_1_1 with dissolve

    cat_lmr "День как-то незаметно прошёл."
    nik_kun "Ну-ну, гуляли всё время туда сюда после атракционов."
    cat_lmr "Да что эти атракционы.{w} На круге пару раз туда-сюда и ваты поели."
    nik_kun "Тебе не понравилась сладкая вата?"

    hide cat_doesntmatter_full_1_1
    show cat_smile_full_1_1
    with dspr

    cat_lmr "Почему сразу так грубо.{w} Просто в ней много сахара."
    nik_kun "Ну конечно, она же {i}сахарная!{/i}{w} Раз так, то могла бы мне отдать!"

    hide cat_smile_full_1_1
    show cat_sohappy_full_1_2
    with dspr

    cat_lmr "Лишь пузо привык набивать, дитё."
    nik_kun "Ага, и ты скоро будешь готовить этому пузу."

    hide cat_sohappy_full_1_2
    show cat_smile_full_1_1
    with dspr

    cat_lmr "Буду только рада."
    lmr_thk "Катя уселась на скамейку в \"нашей\" с ней беседке и закинула ногу на ногу."
    lmr_thk "Я сел рядом, приобняв её за плечо."

    hide cat_smile_full_1_1
    show cat_doesntmatter_full_1_1
    with dspr

    cat_lmr "Ух, погоди, тут так солнце в глаза светит... "

    hide cat_doesntmatter_full_1_1
    show cat_sad_2_2
    with dspr

    extend "Двигайся..."
    lmr_thk "Поёрзав с места на место, нам наконец-то удалось принять положение, в котором удобно будет всем."
    nik_kun "Почему мы здесь?"
    cat_lmr "До конца не знаю.{w} Наверное, из-за красоты и приятных воспоминаний."
    cat_lmr "Знаешь, это место второе по счёту, где я могу почувствовать себя по настоящему оторванной от всего."
    lmr_thk "Я внимательно слушал, ничего не говоря."
    cat_lmr "Первое помнишь?"
    nik_kun "Колесо обозрения."
    cat_lmr "Значит нормально меня слушаешь."
    lmr_thk "Катя отвернулась в сторону и взглянула на небо."
    cat_lmr "Закат скоро, как думаешь, успеем поехать к дереву?"
    nik_kun "Если честно, то я не очень и хочу..."

    hide cat_sad_2_2
    show cat_surprise_2_1
    with dspr

    cat_lmr "С чего вдруг?"
    nik_kun "Разве не помнишь, что мы пожелали забыть то место?"
    cat_lmr "Не говори так странно, Ник, веди себя более природно."
    nik_kun "Я не вижу причин не возвращаться туда.{w} Это просто дерево."
    nik_kun "Ладно, красивое дерево."
    nik_kun "Я всё равно не желаю говорить об этом времени, давай забьём."

    hide cat_surprise_2_1
    show cat_angry_full_2_1
    with dspr

    cat_lmr "Почему ты такой упёртый?!{w} Это не то поведение, которое я привыкла видеть и терпеть!"

    hide cat_angry_full_2_1
    show cat_surprise_2_1
    with dspr

    nik_kun "Ну так не терпи!"

    hide cat_surprise_2_1
    show cat_sad_full_2_1
    with dspr

    cat_lmr "Ник..."
    nik_kun "Прости меня, Кэтрин, но иногда у людей в голове происходит слишко много событий, да таких, что я хер соберусь нормально."
    nik_kun "Я тоже волнуюсь по поводу завтра. Я очень хочу, чтоб оно, кроме того, что наступило, так и наступило мне на руку."
    nik_kun "Знаешь скольким я жертвую?"

    hide cat_sad_full_2_1
    show cat_angry_full_2_1
    with dspr

    cat_lmr "Не делай из меня виноватую!{w} Ты сам говорил, что хочешь другого, так определись, чего ты хочешь понастоящему!"
    nik_kun "Твою мать, я хочу просто быть рядом с тобой, Кэтрин Винтерс!"

    hide cat_angry_full_2_1
    show cat_surprise_2_1
    with dspr

    nik_kun "Я знаю, что это будет сложно, но мне насрать!{w} Если нужно будет, то я хоть свою одежду продам, чтоб тебя прокормить!"
    lmr_thk "Катя находилась в явной расстеряности."
    nik_kun "Хватит терпеть эти иллюзии, что всё - это сказка.{w} Мне сложно жить тем днём, мне хочется завтра, милое завтра, которое я построю для тебя!"
    nik_kun "Потому что я люблю тебя, я всё время только то и делал, что думал о тебе и любил!"

    window hide

    hide cat_surprise_2_1
    $ persistent.cg4 = True
    scene fullposter4
    with flash

    pause 5

    stop ambience fadeout 3
    stop music fadeout 3
    scene black with Dissolve(3.0)

    pause 2.5

    $ night_time()
    scene lmr_water_night with dissolve2

    play music let_smbd_go fadein 3

    window show

    lmr_thk "Этот день был действительно странным.{w} Возможно, коротким для части людей."
    lmr_thk "Наступила настоящая тьма."
    lmr_thk "Ночной город не выглядел таким привлекательным, по сравнению с локальной набережной."
    lmr_thk "Множество продавцов и ресторанчиков открывались именно в это время."
    lmr_thk "Я никогда особо не любил закупаться в подобных местах.{w} В мою душу влезли самые обычные супермаркеты."
    lmr_thk "Катя держала мою руку, неспешно прогуливаясь и смотря на звёзды."
    nik_kun "Как тебе здесь?"

    show cat_sad_2_2 with dissolve

    cat_lmr "Знаешь, сложно сказать наверняка.{w} Не подумай, что не нравится, наоборот."
    nik_kun "Днём ты показывала на мост, так это он и есть."
    lmr_thk "Я провёл рукой в сторону железной конструкции."

    hide cat_sad_2_2
    show cat_surprise_2_1
    with dspr

    cat_lmr "Правда? "

    hide cat_surprise_2_1
    show cat_smile_full_1_1
    with dspr

    extend "Я даже не подумала, хаха, глупая."
    nik_kun "Конечно, ты же тут сколько уже живёшь."

    hide cat_smile_full_1_1
    show cat_angry_full_2_1
    with dspr

    cat_lmr "Я вообще-то прикалываюсь."
    nik_kun "Ух, и где таких слов набралась?"

    hide cat_angry_full_2_1
    show cat_sohappy_full_1_2
    with dspr

    cat_lmr "В глупой Америке."
    nik_kun "А у нас, в Советском Союзе, так и говорят."
    cat_lmr "Как?"
    nik_kun "Что она глупая и бездарная, завидует нам."
    cat_lmr "Умора, Ник, умора, даже смеяться не буду."
    nik_kun "Нет, ну вдруг правда.{w} Я же там не был никогда."
    cat_lmr "Тем более.{w} Не был и уже так считает."
    nik_kun "Я не утверждал, что так говорю, просто сказал мнение многих."
    cat_lmr "Теперь можно понять, почему вы переехали."
    nik_kun "Дело в другом..."
    cat_lmr "Хорошо, не спорю, {i}бойфренд.{/i}"

    hide cat_sohappy_full_1_2 with dissolve

    lmr_thk "Кэтрин усмехнулась и отпустила мою руку."
    nik_kun "Да нет, я серьёзно говорю тебе!{w} Не считаю так!"
    nik_kun "Катя, стой!"
    lmr_thk "Но след Кати уже и простыл."
    lmr_thk "Глянув вдаль.."
    nik_kun "Зачем ты бежишь на мост?{w} Ну, Боже..."

    window hide

    scene lmr_bridge_night with wiperight

    window show

    nik_kun "Фух, стой..{w} куда гонишь?"
    cat_lmr "Хотела побыть тут, ты ведь не против?"
    nik_kun "Не против, конечно, но убегать не стоило."
    cat_lmr "А мне всё равно, как следовало.{w} Живу в свободной стране - делаю, что хочу."
    nik_kun "Справедливо..."
    nik_kun "Катя?"
    nik_kun "Ты ведь позвала меня сюда не просто так, верно?"
    cat_lmr "Ник..."

    window hide

    $ persistent.cg5 = True
    scene fullposter5 with Dissolve(3.0)

    pause 3

    window show

    cat_lmr "Я благодарна тебе за этот день.{w} Спасибо, что остаёшься со мной, не смотря на всё то, что было..."
    nik_kun "Ты опять затеваешь этот разговор?"
    cat_lmr "К сожалению..."
    cat_lmr "Ник, не пойми неверно.{w} Мне очень не нравится возвращаться к этой теме, но я просто не могу отпустить это."
    nik_kun "И что ты хочешь от меня?"
    cat_lmr "Ничего..."
    nik_kun "Так зачем тогда.."
    cat_lmr "Всё же хочу..."
    nik_kun "Ну и что же?"
    cat_lmr "Хочу, чтоб ты любил меня не смотря ни на что."
    cat_lmr "Скажи..{w} ты сможешь?"
    lmr_thk "Для Кати такие слова и фразы, за частую, были неприсущными."
    nik_kun "Ну..."
    cat_lmr "Не мямли, Ник, это действительно важно для меня!{w} Ты ведь хочешь, чтоб я была счастливой?"
    lmr_thk "Эта Катя была действительно другой.{w} Не такой, как два года назад.{w} Не такой, как была последнее время."
    lmr_thk "Она поменялась.{w} Стала более..{w} взрослой?{w} Будто бы духовно стала не девушкой, а женщиной."
    nik_kun "Не то что смогу, уже могу."
    cat_lmr "И тебе небезразлична я и был не безразличен наш ребёнок?"
    lmr_thk "Было видно, что она готова заплакать в любой момент, но держалась до последнего."
    nik_kun "Конечно, я ведь не думать о тебе не могу!{w} Это всё часть моей жизни, огромный кусок."
    nik_kun "А почему ты спрашиваешь?{w} Нет, просто раньше..."
    cat_lmr "Николай, в последнее время я пересмотрела свою жизнь, в частности жизнь с тобой..."
    lmr_thk "Кэтрин впервые обратилась ко мне на полное имя."
    cat_lmr "Наше нелепое знакомство..{w} глупое начало отношений...{w} Я до последнего не верила, ни во что."
    cat_lmr "Но ты..{w} ты, Ник..{w} ты заставил меня верить..."
    cat_lmr "Понимаешь, я не хочу быть прошмандовкой.{w} Бегать от одного мужлана к другому...{w} Я хочу спокойную жизнь с любовью и взаимопониманием..."
    cat_lmr "Разве это такое большое желание?"
    nik_kun "Кэтрин..."
    cat_lmr "Я никогда не врала тебе, говорила всё прямо..{w} до одного момента..."
    cat_lmr "И вот сейчас вроде бы всё хорошо. У нас есть планы, возможности, но я не могу довести до конца свою веру..."
    lmr_thk "Я внимательно слушал и анализировал каждое сказаное ей слово."
    cat_lmr "Послушай и ответь честно..{w} если ты не готов, то всё ещё можно порвать билеты и расстаться..."
    nik_kun "Кэтрин, прошу, успокойся!{w} Мне некуда возвращаться, у меня практически никого нету и..{w} и это не обговаривается!{w} Наша мечта!"
    cat_lmr "Если ты не готов, то отпусти меня, прошу..{w} если ты любишь кого-то, то отпусти его..."

    $ persistent.cg6 = True
    scene fullposter6 with dissolve

    lmr_thk "Катя начала плакать.{w} Меня будто заморозило."
    lmr_thk "Не получалось сдвинуться, чтоб успокоить её."
    lmr_thk "На секунду я и сам задумался.{w} Есть ли смысл?"
    lmr_thk "Стоп, о чём я только думаю..{w} я люблю её, она моя жизнь!"
    nik_kun "Катя, пожалуйста, послушай..."
    lmr_thk "Я продолжал смотреть вдаль."
    nik_kun "То что было раньше съело прошлое.{w} Я живу завтра, причём не один.{w} Ты нужна мне, нужна как девушка, как человек, как та, без которой я не могу жить."
    nik_kun "Я не могу покинуть тебя, ведь хочу строить нас вместе.{w} Это сложный шаг, который я беру на себя."
    nik_kun "За нами больше не гонится КГБ или американская разведка.{w} В нашей жизнь настало спокойствие, и мы имеем принимать любые решения."
    nik_kun "Сейчас я принимаю решение быть с тобой ещё целые года."
    nik_kun "Мы давно выросли, изменились.{w} Теперь мы более нежные и ласковые."
    nik_kun "Наши слова не пишет какой-то человек, или не расставляет локации, на которых мы будем проживать дни. Мы делаем это сами, пойми."
    nik_kun "Если бы я не любил тебя, то сейчас бы не стоял здесь, а ты не была бы рядом..."
    lmr_thk "Рука порылась в кармане и вытянула два билета."
    nik_kun "Эти два кусочка бумаги вознесут нас к самим облакам, отправив в новую часть нашей жизни.{w} Я готов измениться, изменить дом, но я не готов изменить тебя!"
    cat_lmr "Никки...{w} Ты говоришь правду?"
    nik_kun "Я не умею врать, точно также, как и ты.{w} Если с этим условием мы вместе через года, то всё будет ещё лучше."
    cat_lmr "Вместе..{w} всю жизнь..."
    nik_kun "Конечно, Катюша."

    scene fullposter5 with dissolve

    lmr_thk "Кэтрин вытерла слёзы и продолжала смотреть в глубь реки, в которой отражались некоторые части фиолетовых звёзд."
    lmr_thk "Этот вечер был создан для части откровения и выливания чувств наружу."

    window hide

    scene black with Dissolve(5.0)

    window show

    lmr_thk "Завтра будет лучше.{w} Завтра всё изменится.{w} Покажут ли лепестки?{w} Точно нет.{w} Это должны показать мы."
    lmr_thk "Наверняка, теперь я знаю точно.{w} Ведь ты - Моя Любовь."

    window hide 

    stop music fadeout 5

    pause 5

    scene lmr_autro with dissolve2
    show credits lmr_renpy_credits:
        xalign 0.5
        ypos 1.3
        linear 260 ypos -4.0
    pause 245
